# print("\n________________________________________")
# s = 0
# k = 30
# d = k - 5
# k = 2 * d
# s = k - 100
# print(s)
# print("\n________________________________________")
# x = 3
# y = 4
# z = x + y
# z = z + 1
# x = y
# y = 5
# x = z + y + 7
# print(x)
# print("\n________________________________________")
# n = int(input())
# print(f"{n}\n{n+1}\n{n+2}")
# print("\n________________________________________")
# # Считываем длину ребра куба
# a = int(input())
# # Вычисляем объём куба: V = a * a * a
# volume = a * a * a
# # Вычисляем площадь полной поверхности: S = 6 * a * a
# surface_area = 6 * a * a
# # Выводим результат в нужном формате
# print("Объем =", volume)
# print("Площадь полной поверхности =", surface_area)
print("\n________________________________________")
a = 82 // 3**2 % 7
print(a)
print(18 % 12)
print(-10**2)
print(-10**3)
print((-10)**2)
print((-10)**3)
print(123 % 10)
a = 15 // (16 % 7)
b = 34 % a * 5 - 29 % 5 * 2
print(a + b)



a = 17 // (23 % 7)
b = 34 % a * 5 - 29 % 4 * 3
print(a * b)